Revit 2027 API
SystemsAnalysisOptions.WeatherFile Property
 The file name of the EnergyPlus weather (*.epw).
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string WeatherFile { get; set; }
Public Property WeatherFile As String
	Get
	Set
public:
property String^ WeatherFile {
	String^ get ();
	void set (String^ value);
}
member WeatherFile : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The analysis requires a valid EnergyPlus weather (.epw) file.
ArgumentNullException |  When setting this property: A non-optional argument was null
Remarks
 When requesting a new system analysis, it is okay to have an empty weather file in the SystemsAnalysisOption. In that case, the ViewSystemsAnalysisReport would use the weather file at the current site location.
See Also
Reference
SystemsAnalysisOptions Class
Autodesk.Revit.DB.Analysis Namespace